src/cf/InformationRegisters/CertificateUsersNotifications.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>CertificateUsersNotifications</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>IsNotified</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Certificate</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DigitalSignatureAndEncryptionKeysCertificates</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>User</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/CertificateUsersNotifications/Ext/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// 
//  
// 
// 
// 
///////////////////////////////////////////////////////////////////////////////////////////////////////

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then
#Region Private

// 
// 
// 
// Parameters:
//  Certificate - CatalogRef.DigitalSignatureAndEncryptionKeysCertificates
// 
// Returns:
//  Boolean - 
//
Function UserAlerted(Certificate) Export

	Query = New Query;
	Query.Text =
	"SELECT
	|	CertificateUsersNotifications.IsNotified
	|FROM
	|	InformationRegister.CertificateUsersNotifications AS CertificateUsersNotifications
	|WHERE
	|	CertificateUsersNotifications.Certificate = &Certificate
	|	AND CertificateUsersNotifications.User = &User";

	Query.SetParameter("User", Users.CurrentUser());
	Query.SetParameter("Certificate", Certificate);
	
	SetPrivilegedMode(True);
	QueryResult = Query.Execute();
	SetPrivilegedMode(False);
	SelectionDetailRecords = QueryResult.Select();
	If SelectionDetailRecords.Next() Then
		Return SelectionDetailRecords.IsNotified;
	EndIf;

	Return False;

EndFunction

#EndRegion
#EndIf
